Update readme, cut image size
